# ðŸ“Š LEVEL 1 â€” Data Exploration

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [24]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/crm_sales')

In [55]:
tables = ['accounts','data_dictionary','products', 'sales_pipeline', 'sales_teams']

In [71]:
for table in tables:
    query = f"""select * from {table} limit 10;"""
    table_data = pd.read_sql(query, engine)
    print(f'{table} Table')
    display(table_data)

accounts Table

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
0,Acme Corporation,technolgy,1996,1100.04,2822,United States,
1,Betasoloin,medical,1999,251.41,495,United States,
2,Betatech,medical,1986,647.18,1185,Kenya,
3,Bioholding,medical,2012,587.34,1356,Philipines,
4,Bioplex,medical,1991,326.82,1016,United States,
5,Blackzim,retail,2009,497.11,1588,United States,
6,Bluth Company,technolgy,1993,1242.32,3027,United States,Acme Corporation
7,Bubba Gump,software,2002,987.39,2253,United States,
8,Cancity,retail,2001,718.62,2448,United States,
9,Cheers,entertainment,1993,4269.90,6472,United States,Massive Dynamic

data_dictionary Table

      Table             Field                          Description
0  accounts           account                         Company name
1  accounts            sector                             Industry
2  accounts  year_established                     Year Established
3  accounts           revenue  Annual revenue (in millions of USD)
4  accounts         employees                  Number of employees
5  accounts   office_location                         Headquarters
6  accounts     subsidiary_of                       Parent company
7  products           product                         Product name
8  products            series                       Product series
9  products       sales_price               Suggested retail price

products Table

          product series  sales_price
0       GTX Basic    GTX          550
1         GTX Pro    GTX         4821
2      MG Special     MG           55
3     MG Advanced     MG         3393
4    GTX Plus Pro    GTX         5482
5  GTX Plus Basic    GTX         1096
6         GTK 500    GTK        26768

sales_pipeline Table

,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,2016-10-20,2017-03-01,1054
1,Z063OYW0,Darcel Schlecht,GTXPro,Isdom,Won,2016-10-25,2017-03-11,4514
2,EC4QE1BX,Darcel Schlecht,MG Special,Cancity,Won,2016-10-25,2017-03-07,50
3,MV1LWRNH,Moses Frase,GTX Basic,Codehow,Won,2016-10-25,2017-03-09,588
4,PE84CX4O,Zane Levy,GTX Basic,Hatfan,Won,2016-10-25,2017-03-02,517
5,ZNBS69V1,Anna Snelling,MG Special,Ron-tech,Won,2016-10-29,2017-03-01,49
6,9ME3374G,Vicki Laflamme,MG Special,J-Texon,Won,2016-10-30,2017-03-02,57
7,7GN8Q4LL,Markita Hansen,GTX Basic,Cheers,Won,2016-11-01,2017-03-07,601
8,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,2016-11-01,2017-03-03,1026
9,NL3JZH1Z,Anna Snelling,MG Special,Bioholding,Won,2016-11-04,2017-03-10,53

sales_teams Table

          sales_agent           manager regional_office
0       Anna Snelling  Dustin Brinkmann         Central
1      Cecily Lampkin  Dustin Brinkmann         Central
2   Versie Hillebrand  Dustin Brinkmann         Central
3     Lajuana Vencill  Dustin Brinkmann         Central
4         Moses Frase  Dustin Brinkmann         Central
5  Jonathan Berthelot     Melvin Marxen         Central
6   Marty Freudenburg     Melvin Marxen         Central
7    Gladys Colclough     Melvin Marxen         Central
8     Niesha Huffines     Melvin Marxen         Central
9     Darcel Schlecht     Melvin Marxen         Central

### Q1. List all companies (accounts) with their sector, revenue, and number of employees.

In [69]:
query = f"""select account,sector,revenue,employees from accounts;"""
table_data = pd.read_sql(query, engine)
display(table_data)

             account         sector  revenue  employees
0   Acme Corporation      technolgy  1100.04       2822
1         Betasoloin        medical   251.41        495
2           Betatech        medical   647.18       1185
3         Bioholding        medical   587.34       1356
4            Bioplex        medical   326.82       1016
..               ...            ...      ...        ...
80        Zathunicon         retail    71.12        144
81    Zencorporation      technolgy    40.79        142
82            Zoomit  entertainment   324.19        978
83           Zotware       software  4478.47      13809
84          Zumgoity        medical   441.08       1210

[85 rows x 4 columns]

### Q2. Display all unique sectors from the accounts table.

In [75]:
query = f"""select DISTINCT sector from accounts;"""
table_data = pd.read_sql(query, engine)
display(table_data)

               sector
0           technolgy
1             medical
2              retail
3            software
4       entertainment
5           marketing
6  telecommunications
7             finance
8          employment
9            services

### Q3. Show the total number of accounts present in the CRM database.

In [ ]:
query = """select count(*) from accounts;"""
table_data = pd.read_sql(query,engine)
display(table_data)

   count(*)
0        85

### Q4. Find the average revenue of all companies.

In [78]:
query = """select avg(revenue) as Avg_revenue from accounts;"""
table_data = pd.read_sql(query,engine)
display(table_data)

   Avg_revenue
0  1994.632941

### Q5. Show all companies located in the United States.

In [101]:
query = """select account,office_location from accounts where office_location = 'United States';"""
table_data = pd.read_sql(query,engine)
display(table_data)

             account office_location
0   Acme Corporation   United States
1         Betasoloin   United States
2            Bioplex   United States
3           Blackzim   United States
4      Bluth Company   United States
..               ...             ...
66            Yearin   United States
67        Zathunicon   United States
68            Zoomit   United States
69           Zotware   United States
70          Zumgoity   United States

[71 rows x 2 columns]

### Q6. List all companies established before the year 2000.

In [95]:
query = """select account,year_established from accounts where year_established < 2000;"""
table_data = pd.read_sql(query,engine)
display(table_data)

                      account  year_established
0            Acme Corporation              1996
1                  Betasoloin              1999
2                    Betatech              1986
3                     Bioplex              1991
4               Bluth Company              1993
5                      Cheers              1993
6                     Codehow              1998
7                     dambase              1995
8                     Domzoom              1998
9                 Donquadtech              1992
10                   Dontechi              1982
11                    Donware              1999
12                 Fasehatice              1990
13                   Faxquote              1995
14                     Finjob              1988
15                 Funholding              1991
16                  Ganjaflex              1995
17                 Gekko & Co              1990
18                     Hatfan              1982
19                   Hottechi              1997
20                    Initech              1994
21                      Inity              1986
22                    J-Texon              1989
23                   Kan-code              1982
24                      Konex              1980
25                  Konmatfix              1985
26                   Labdrill              1985
27            Massive Dynamic              1989
28                  Mathtouch              1984
29                    Nam-zim              1987
30                      Newex              1991
31                  Ontomedia              1997
32                   Opentech              1994
33                   Rangreen              1987
34                   Rantouch              1994
35                   Ron-tech              1992
36                  Rundofase              1983
37                   Scotfind              1996
38                      Silis              1994
39               Singletechno              1996
40                     Sonron              1999
41                 Stanredtax              1987
42               Statholdings              1997
43                  Streethex              1988
44      The New York Inquirer              1996
45                   Toughzap              1995
46                  Treequote              1988
47       Umbrella Corporation              1998
48  Vehement Capital Partners              1993
49                  Warephase              1997
50                 Xx-holding              1993
51                   Xx-zobam              1989
52              Y-corporation              1983
53                     Zoomit              1992
54                    Zotware              1979
55                   Zumgoity              1984

### Q7. Find the oldest company and its year of establishment.

In [112]:
query = """select account,year_established from accounts order by  year_established Asc limit 1;"""
table_data = pd.read_sql(query,engine)
display(table_data)

   account  year_established
0  Zotware              1979

### Q8. List all companies that are subsidiaries of another company.

In [157]:
query = """select * from accounts WHERE subsidiary_of IS NOT NULL AND subsidiary_of <> '';"""
table_data = pd.read_sql(query, engine)
display(table_data)

,account,sector,year_established,revenue,employees,office_location,subsidiary_of
0,Bluth Company,technolgy,1993,1242.32,3027,United States,Acme Corporation
1,Cheers,entertainment,1993,4269.90,6472,United States,Massive Dynamic
2,Codehow,software,1998,2714.90,2641,United States,Acme Corporation
3,Dalttechnology,software,2013,98.79,96,United States,Bubba Gump
4,dambase,marketing,1995,2173.98,2928,United States,Inity
5,Donquadtech,technolgy,1992,1712.68,3194,United States,Acme Corporation
6,Faxquote,telecommunications,1995,1825.82,5595,United States,Sonron
7,Funholding,finance,1991,2819.50,7227,United States,Golddex
8,Gogozoom,telecommunications,2007,86.68,187,United States,Sonron
9,Iselectrics,technolgy,2011,527.11,1428,United States,Acme Corporation
10,Nam-zim,services,1987,405.59,1179,Brazil,Warephase
11,Scotfind,software,1996,6354.87,16780,United States,Bubba Gump
12,Scottech,marketing,2012,45.39,100,United States,Inity
13,Treequote,telecommunications,1988,5266.09,8595,United States,Sonron
14,Vehement Capital Partners,finance,1993,646.10,883,United States,Golddex

###### if the query WHERE subsidiary_of IS NOT NULL returns rows, but those rows appear to have nothing in the subsidiary_of column, it's almost certainly because the column contains blank spaces, empty strings, or other invisible characters instead of a true NULL value.

### Q9. Show all medical sector companies and their revenue.

In [169]:
query = """select account,sector,revenue from accounts where sector = 'medical';"""
table_data = pd.read_sql(query, engine)
display(table_data)

                  account   sector  revenue
0              Betasoloin  medical   251.41
1                Betatech  medical   647.18
2              Bioholding  medical   587.34
3                 Bioplex  medical   326.82
4                  Condax  medical     4.54
5                   Isdom  medical  3178.24
6                Labdrill  medical  2741.37
7              Lexiqvolax  medical  1618.89
8                Ron-tech  medical  3922.42
9                   Silis  medical  2818.38
10  The New York Inquirer  medical   439.21
11               Zumgoity  medical   441.08

### Q10. Find the total number of employees across all companies.

In [174]:
query = """select sum(employees) as Total_employees from accounts ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

   Total_employees
0         396170.0